package MyTest;

public class _TaskDescription {

// Напиши программу которая принимает на вход строку из крестиков-ноликов и возвращает один из следующих статусов:
// Неправильный ввод
// Правильный ввод, некорректный статус
// Корректный статус, игра закончена - ничья
// Корректный статус, игра закончена, “крестики” выиграли
// Корректный статус, игра закончена, “нолики” выиграли
// Корректный статус, игра продолжается, крестики ходят
// Корректный статус, игра продолжается, нолики ходят
// Для упрощения - начинают “крестики”.
// Постарайся использовать техники тест-дизайна - если неправильный ввод, то дальше проверка не идёт
// Пример “XODPLXX” - неправильный ввод
// “XXXOOOOOO” - Правильный ввод, некорректный статус
// “X--------”  Корректный статус, игра продолжается, нолики ходят
// “О--------”  Правильный ввод, некорректный статус
// Постарайся структурировать проект, Используй логические выражения
// Используй регулярки, Сделай максимально просто

}